### Operaciones básicas con Dataframes

In [3]:
#cargamos todo para inciar
import pandas as pd
import os
print(os.getcwd())

C:\Users\CPU

In [9]:
os.chdir('C:\\Users\\CPU\\Jupiter-docus\\Seccion5-Datos')
datos = pd.read_csv('DatosDemograficos.csv')

In [25]:
datos.columns = ['NombrePais','CodigoPais','TasaNatalidad','UsuariosInternet','GrupoIngresos']

In [29]:
datos.columns

Index(['NombrePais', 'CodigoPais', 'TasaNatalidad', 'UsuariosInternet',
       'GrupoIngresos'],
      dtype='object')

---

In [ ]:
#Operaciones Básicas con DataFrames

In [41]:
datos[['NombrePais','TasaNatalidad','UsuariosInternet']][4:8]

             NombrePais  TasaNatalidad  UsuariosInternet
4  United Arab Emirates         11.044              88.0
5             Argentina         17.716              59.9
6               Armenia         13.308              41.9
7   Antigua and Barbuda         16.447              63.4

In [ ]:
#operaciones matemáticas

In [45]:
#multiplicar columna x columna, ej:
resultado = datos.TasaNatalidad * datos.UsuariosInternet

In [47]:
resultado.head()

0    808.2516
1    207.9927
2    878.3135
3    736.5644
4    971.8720
dtype: float64

In [55]:
#ahora agregamos la columna a nuestro DataFrama
#le indicamos la cabecera de la columna y le damos la operacion que tiene que realizar
datos['MiCalculo'] = datos.TasaNatalidad * datos.UsuariosInternet

In [57]:
datos.head()

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos,MiCalculo
0,Aruba,ABW,10.244,78.9,Ingreso alto,808.2516
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo,207.9927
2,Angola,AGO,45.985,19.1,Ingreso medio alto,878.3135
3,Albania,ALB,12.877,57.2,Ingreso medio alto,736.5644
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto,971.8720

In [59]:
#COMPARACION CON LENGUAJE R: 
 datos['nombrecolumnanueva'] =[1,2,3,4,5] #esto lo mete R en bucle hasta rellenar todas las filas
#en Python esto da error ya que es muchos menos datos que filas para rellenar

In [ ]:
#REMOVER UNA COLUMNA

In [71]:
#datos.drop('MiCalculo')  #así da error ya que x defecto se usa en filas, y no hay una fila llamada MiCalculo
#Si pulsamos shit+tab nos da notificaciones de la función.

datos.drop('MiCalculo',axis=1)

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo

In [67]:
datos.head()  #sigue saliendo la columna

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos,MiCalculo
0,Aruba,ABW,10.244,78.9,Ingreso alto,808.2516
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo,207.9927
2,Angola,AGO,45.985,19.1,Ingreso medio alto,878.3135
3,Albania,ALB,12.877,57.2,Ingreso medio alto,736.5644
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto,971.8720

In [73]:
#redefinimos el dataframe datos con el drop.

datos = datos.drop('MiCalculo',axis=1) 
#axis=1 indica que busca en el indice de las columnas, así busca 'MiCalculo' en la cabecera
datos.head()  #así ya que se ha elimina la columna

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto